spec/fixtures/files/stripe/charge_subscription.json

{
  "id": "ch_1HcdZOHwuhGySQCdFQTUBt2n",
  "object": "charge",
  "amount": 400,
  "amount_captured": 400,
  "amount_refunded": 0,
  "application": null,
  "application_fee": null,
  "application_fee_amount": null,
  "balance_transaction": "txn_1HcdZOHwuhGySQCdgLkuuCZJ",
  "billing_details": {"address":{"city":null,"country":null,"line1":null,"line2":null,"postal_code":null,"state":null},"email":null,"name":null,"phone":null},
  "calculated_statement_descriptor": "GOCLIMATE",
  "captured": true,
  "created": 1602795666,
  "currency": "eur",
  "customer": "cus_HHiRiN65u3JZs1",
  "description": "Invoice 860DEE2B-0006",
  "destination": null,
  "dispute": null,
  "disputed": false,
  "failure_code": null,
  "failure_message": null,
  "fraud_details": {},
  "invoice": "in_1HcbxwHwuhGySQCda0KWYyqp",
  "livemode": false,
  "metadata": {},
  "on_behalf_of": null,
  "order": null,
  "outcome": {"network_status":"approved_by_network","reason":null,"risk_level":"normal","risk_score":58,"seller_message":"Payment complete.","type":"authorized"},
  "paid": true,
  "payment_intent": "pi_1HcdZNHwuhGySQCdgIBvvyJm",
  "payment_method": "pm_1Gj90gHwuhGySQCdiHURhSs6",
  "payment_method_details": {"card":{"brand":"visa","checks":{"address_line1_check":null,"address_postal_code_check":null,"cvc_check":null},"country":"US","exp_month":5,"exp_year":2022,"fingerprint":"AFDR1kTX598pXWiQ","funding":"credit","installments":null,"last4":"4242","network":"visa","three_d_secure":null,"wallet":null},"type":"card"},
  "receipt_email": null,
  "receipt_number": null,                                                                                                                                                                                                                                                                                                                              "receipt_url": "https://pay.stripe.com/receipts/acct_1A09wWHwuhGySQCd/ch_1HcdZOHwuhGySQCdFQTUBt2n/rcpt_ID3gShjqWikSlIBSDVq2kJwxZwl8WyX",
  "refunded": false,
  "refunds": {"object":"list","data":[],"has_more":false,"total_count":0,"url":"/v1/charges/ch_1HcdZOHwuhGySQCdFQTUBt2n/refunds"},
  "review": null,
  "shipping": null,
  "source": null,
  "source_transfer": null,
  "statement_descriptor": null,
  "statement_descriptor_suffix": null,
  "status": "succeeded",
  "transfer_data": null,
  "transfer_group": null
}
